---
type: FabricationItemFolder
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# FabricationItemFolder

`Autodesk.Revit.DB.FabricationItemFolder` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetItemFiles | 2019 | `public IList < FabricationItemFile > GetItemFiles ()` |
| Method | GetSubFolders | 2019 | `public IList < FabricationItemFolder > GetSubFolders ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | 2019 | `public string Name { get ; }` |